#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.infrastructure.module.kubernetes_config.helm_release.elasticsearch will be updated in-place
  ~ resource "helm_release" "elasticsearch" {
        atomic                = false
        chart                 = "elasticsearch"
        cleanup_on_fail       = false
        dependency_update     = false
        disable_crd_hooks     = false
        disable_webhooks      = false
        force_update          = false
        id                    = "elasticsearch"
        max_history           = 0
        metadata              = [
            {
                chart     = "elasticsearch"
                name      = "elasticsearch"
                namespace = "default"
                revision  = 1
                values    = "null"
                version   = "7.6.1"
            },
        ]
        name                  = "elasticsearch"
        namespace             = "default"
        recreate_pods         = false
        render_subchart_notes = true
        replace               = false
        repository            = "https://helm.elastic.co"
        reset_values          = false
        reuse_values          = false
        skip_crds             = false
        status                = "deployed"
        timeout               = 300
      + values                = [
          + <<~EOT
                esConfig:
                  elasticsearch.yml: |
                    xpack.security.enabled: true
                    xpack.security.transport.ssl.enabled: true
                    xpack.security.transport.ssl.verification_mode: certificate
                    xpack.security.transport.ssl.key: /usr/share/elasticsearch/config/certs/private_key_pem.crt
                    xpack.security.transport.ssl.certificate: /usr/share/elasticsearch/config/certs/certificate_pem.crt
                    xpack.security.transport.ssl.certificate_authorities: [ "/usr/share/elasticsearch/config/certs/issuer_pem.crt" ]
                
                secretMounts:
                  - name: elastic-certificates
                    secretName: elasticsearch-certificates
                    path: /usr/share/elasticsearch/config/certs
            EOT,
        ]
        verify                = false
        version               = "7.6.1"
        wait                  = true
    }

  # module.infrastructure.module.kubernetes_config.kubernetes_secret.elasticsearch_internal_certificate will be created
  + resource "kubernetes_secret" "elasticsearch_internal_certificate" {
      + data = (sensitive value)
      + id   = (known after apply)
      + type = "Opaque"

      + metadata {
          + generation       = (known after apply)
          + name             = "elasticsearch-certificates"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "api_secret_key_base" but a
value was found in file "/terraform/terraform.tfvars". To use this value, add
a "variable" block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
